app/views/carts/_current_cart_list.html.haml

      = t('.total_price')
      = @cart.products.sum(:price)
---
SELECT "products".* FROM "products" INNER JOIN "carts_products" ON "products"."id" = "carts_products"."product_id" WHERE "carts_products"."cart_id" = $1  [["cart_id", 66]]
SELECT SUM("products"."price") FROM "products" INNER JOIN "carts_products" ON "products"."id" = "carts_products"."product_id" WHERE "carts_products"."cart_id" = $1  [["cart_id", 66]]