app/views/carts/show.html.haml


- if @cart.products.count == 0 then
---
SELECT COUNT(*) FROM "products" INNER JOIN "carts_products" ON "products"."id" = "carts_products"."product_id" WHERE "carts_products"."cart_id" = $1  [["cart_id", 1]]