app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cart = Cart.find(session[:cart_id])

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def add
    @cart = current_cart
    @product = Product.find(params[:product_id])