app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "HIFI"], ["description", "Car"], ["price", 234.0], ["created_at", 2016-11-07 18:48:51 UTC], ["updated_at", 2016-11-07 18:48:51 UTC]]
---
  def create
    Product.create(products_param)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 3]]
---
  def destroy
     if @product.destroy